
class BotToken:
	API_TOKEN = '1239227689:AAFJUSP-q5FuGqOw_LzTSwyPk-Kkw-cBUsI'  # t.me/VsehObuem_bot
	#API_TOKEN = '1090271153:AAGZF0toeX9uJ56yv_y1sI94Ghkb2Ku_YNE' # @tester3Bot
	HOST_ID = 164718531


class Files:
	BASE_FILE = 'shoes.xlsx'


class Messages:
	START_MESSAGE = '✋ Привет, очень рад, что ты с нами!\n' \
	                'Я могу помочь тебе выбрать отличную обувь.\n' \
	                '👟 👞 🥿 👠 🥾\n' \
	                'Есть вопросы? Для связи с нами пиши:\n' \
	                'https://t.me/VsehObuem \n' \
					'Мы в ВК:\n' \
	                'https://vk.com/vsehobuemekb \n' \

	MORE_PHOTOS_MESSAGE = '\n\nБольше фото в нашей группе вконтакте'

	BRAND_MESSAGE = 'Выбери понравившуюся модель'
	ALARM_MESSAGE = 'Начать сначала'
	GOOD_BAY_MESSAGE = 'Ваш заказ уже поступил в обработку!\n' \
	                   'Наш менеджер в ближайшее время свжется с Вами для уточнения деталей:\n' \
	                   '- размер обуви\n' \
	                   '- время и место доставки\n' \
	                   '- способ оплаты\n' \
	                   'Спасибо!'

	BACK_TO_START_BUTTON = '🔝 Главное меню'
	BACK_TO_MODEL_CHOICE_BUTTON = '🔙 Выбор модели'

	VIEW_PRICE_BUTTON = '💵 Узнать цену', 'VIEW_PRICE'
	GET_BUY_BUTTON = '🛒 Заказать', 'GET_BUY'
	SHOW_PHONE_BUTTON = '📲 Показать телефон'
